Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: For internal communication (RPC calls, data transfer, and blob service communication to distribute libraries or other artifacts) all Flink processes (Dispatcher, ResourceMan‐ ager, JobManager, and TaskManager) perform mutual authentication— senders and receivers validate each other via an SSL certificate.
zh_cn: 对于内部通信（RPC调用，数据传输，用以分发类库或其他工件（Artifact）的Blob服务通信），所有Flink进程（Dispatcher，ResourceManager，JobManager及TaskManager）都会相互验证身份——发送者和接受者需要利用SSL证书完成验证。

source: For larger setups, you need to tune the configuration as described in Chapter 9.
zh_cn: 而对于大型设置场景，需要根据第9章的介绍调节配置。

source: For larger setups, you need to tune the configuration as described in “Main Memory and Network Buffers” on page 240.
zh_cn: 而对于大型使用场景，需要根据第240页"内存和网络缓冲"一节所介绍的内容调整配置。

source: For leader election in highly available setups, Flink depends on Apache ZooKeeper.
zh_cn: 它依赖Apache ZooKeeper来完成高可用性设置中的领导选举工作。

source: For leader election in highly-available setups, Flink depends on Apache ZooKeeper.
zh_cn: Flink依赖Apache ZooKeeper来完成高可用设置中的领导选举过程。

source: For local state management, a state backend stores all keyed states and ensures that all accesses are correctly scoped to the current key.
zh_cn: 对于本地状态管理，状态后端会存储所有键值分区状态，并保证能将状态访问范围正确地限制在当前键值。

source: For low-level operations on two inputs, the DataStream API also provides the CoProcessFunction.
zh_cn: 针对有两个输入的底层操作，DataStream API还提供了CoProcessFunction。

source: For many applications, the SinkFunction interface is sufficient to implement an idempotent sink connector.
zh_cn: 对于很多应用而言，利用SinkFunction接口足以实现幂等性数据汇连接器。

source: For some operators it can be important to know whether a checkpoint completed or not.
zh_cn: 对一些算子而言，了解检查点的完成情况非常重要。

source: For some storage systems, Flink provides sink functions that feature exactly-once output, for example, by committing emitted records on checkpoint completion.
zh_cn: 对于某些存储系统，Flink提供的数据汇函数支持精确一次输出，例如，在检查点完成后才会把写出的记录正式提交。

source: For some use cases it might also be necessary to distinguish between the first result and an update due to a late event.
zh_cn: 对大多数用例而言，可能还要对首次结果和由于迟到事件产生的更新结果加以区分。

source: For state backends that de/serialize state objects when reading or writing, such as RocksDBStateBackend, the choice of the state primitive (ValueState, ListState, or MapState) can have a major impact on the performance of an application.
zh_cn: 对于那些在读写状态时涉及对象序列化和反序列化的状态后端（如RocksDBStateBackend），状态原语（ValueState、ListState或MapState）的选择将对应用性能产生决定性的影响。

source: For such advanced applications, a good understanding of Flink’s internal time handling is often helpful and sometimes required.
zh_cn: 在面对这些高级应用时，充分理解Flink内部事件处理机制通常会有所帮助，有时候更是必要的。

source: For such cases, Flink provides the BoundedOutOfOrder nessTimeStampExtractor, which takes the maximum expected lateness as an argu‐ ment:
zh_cn: 针对这种情况，Flink提供了BoundedOutOfOrdernessTimeStampExtractor，它接收一个表示最大预期延迟的参数：

source: For the RocksDB state backend you can define one or more paths at which RocksDB stores its local files (state.back end.rocksdb.localdir) and whether timer state is stored on the heap (default) or in RocksDB (state.backend.rocksdb.timer-service.factory).
zh_cn: 对于RocksDB状态后端，你可以定义用于本地文件存储的路径（state.backend.rocksdb.localdir）以及是将计时器存放在堆中（默认配置）还是RocksDB中（state.backedn.rocksdb.timer-service.factory）。

source: For the first input, all records with timestamps larger than the current watermark—the upper bound— are buffered.
zh_cn: 对第一个输入而言，所有时间戳大于当前水位线减去间隔上界的数据都会被缓冲起来；

source: For the remainder of this section, we focus on the universal connector and refer you to Flink’s documentation for the version-specific connectors.
zh_cn: 在本章其余部分，我们会把关注点放在通用的连接器上面。如果你想了解某个特定版本的连接器，请参阅Flink的相关文档。

source: For the remainder of this section, we focus on the uni‐ versal connector and for the version-specific connectors, we refer you to Flink’s documentation.
zh_cn: 在本章其余部分，我们会把关注点放在通用的连接器上面。如果你想了解某个特定版本的连接器，请参阅Flink的相关文档。

source: For the second input, all records with timestamps larger than the current watermark + the lower bound are buffered.
zh_cn: 对第二个输入而言，所有时间戳大于当前水位线加上间隔下界的数据都会被缓冲起来。

source: For this example, your system needs Java 8 installed.
zh_cn: 为此你需要先安装Java 8。

source: For this your system needs to have Java 8 installed.
zh_cn: 为此你需要先安装Java 8。

source: For two operators con‐ nected by a partitioning or broadcasting connection the number of network buffers depends on the product of the sending and receiving operator parallelism.
zh_cn: 对于通过分区或广播策略连接的两个算子，其网络缓冲区的需求量取决于发送和接收算子并行度的乘积。

source: Fortunately, in many cases, you can partition the state by a key and manage the state of each partition independently.
zh_cn: 幸运的是，在很多情况下可以把状态按照键值划分，并独立管理每一部分。

source: Framework style
zh_cn: 框架模式

source: Framework style: In this mode, Flink applications are packaged into a JAR file and submitted by a client to a running service.
zh_cn: 框架模式：在本模式下，Flink应用会打包成一个JAR文件并通过客户端提交到运行的服务上。

source: Frequent synchronization is a major reason for performance limitations in dis‐ tributed systems.
zh_cn: 频繁地同步是分布式系统产生性能瓶颈的主要原因。

source: From a savepoint-compatibility point of view this means an application can be evolved in three ways:
zh_cn: 从保存点兼容性的角度来看，应用可以通过以下三种方式进行更新：

source: From there, the late events can be processed or emitted using a regular sink
zh_cn: 这样就可以对它们进行后续处理或利用常规的数据汇函数将其写出。

source: FsStateBackend only requires a path to define the storage location for checkpoints.
zh_cn: FsStateBackend只需一个用于定义检查点存储位置的路径。

source: FsStateBackend stores the local state on the TaskManager’s JVM heap, just like MemoryStateBackend.
zh_cn: FsStateBackend和MemoryStateBackend一样，将本地状态保存在TaskManager的JVM堆内。

source: Full window functions collect all elements of a window and iterate over the list of all collected elements when they are evaluated.
zh_cn: 全量窗口函数。它会收集窗口内的所有元素，并在执行计算时对它们进行遍历。

source: Full window functions usually require more space but allow for more complex logic than incremental aggrega‐
zh_cn: 虽然全量窗口函数通常需要占用更多空间，但它和增量聚合函数相比，支持更复杂的逻辑。

source: Function Classes
zh_cn: 函数类

source: FunctionSnapshotCon text gives access to the unique identifier of the checkpoint and the timestamp when the JobManager initiates the checkpoint.
zh_cn: 从FunctionSnapshotContext中，我们可以得到检查点的唯一标识以及JobManager初始化检查点时的时间戳。

source: Functions Must Be Java Serializable
zh_cn: 函数必须是Java可序列化的

source: Functions are called with data objects and emit data objects.
zh_cn: 函数在调用时会传入数据对象，同时它也可以发出数据对象。

source: Functions are not able to read or modify record timestamps and watermarks, except for the ProcessFunc tion which can read the timestamp of a currently processed record, request the current event-time of the operator, and register timers4.
zh_cn: Flink中的普通函数无法读写记录的时间戳或水位线。但有一个例外——ProcessFunction，它可以读取当前正在处理记录的时间戳，请求获取当前算子的事件时间以及注册定时器。

source: Functions are written by the application programmer and implement custom computation logic.
zh_cn: 函数由应用开发人员编写，可用来实现某些自定义的计算逻辑。

source: Functions can also be implemented as anonymous classes:
zh_cn: 还可以通过匿名类来实现函数：

source: Functions can receive parameters through their constructor.
zh_cn: 函数可以通过其构造函数接收参数。

source: Functions can reuse Java tuples in order to reduce the pressure on the garbage collector.
zh_cn: 函数中可以对Java元组进行重用，以减轻垃圾回收器的压力。

source: Functions cannot read or modify record time‐ stamps and watermarks, except for the process functions, which can read the timestamp of a currently processed record, request the current event time of the operator, and register timers.3 None of the functions exposes an API to set the timestamps of emitted records, manipulate the event-time clock of a task, or emit watermarks.
zh_cn: 普通函数无法读写记录的时间戳或水位线，但一系列处理函数（process function）除外。它们可以读取当前正在处理记录的时间戳，获得当前算子的事件时间，还能注册计时器。3 所有函数的API都无法支持设置发出记录的时间戳、调整任务的事件时间时钟或发出水位线。

source: Fundamentals, Implementation, and Operation
zh_cn: 流式应用基础、实现及操作

source: Further options to configure the checkpointing behavior are provided by the Check pointConfig, which can be obtained from the StreamExecutionEnvironment:
zh_cn: 你还可以利用从StreamExecutionEnvironment中获取的CheckpointConfig对检查点进行更多配置：

source: Further, Flink offers domain-specific libraries and APIs for relational queries, complex event processing (CEP), and graph processing.
zh_cn: 此外，Flink为关系查询、CEP（complex event processing复杂事件处理）和图计算都提供了领域相关的库和API。

source: Further, it includes methods for accessing partitioned state.
zh_cn: 另外它还提供了访问分区状态的方法。

source: Furthermore, Flink can reset the state of an application to a previous savepoint, making it possible to evolve or rescale an application without losing its state.
zh_cn: 此外，Flink可以将应用状态重置到之前的某个检查点，从而允许应用在不丢失状态的前提下更新或扩缩容。

source: Future[String] holds the result of the JDBC query.
zh_cn: Future[String]保存了JDBC的查询结果。

source: Gelly for Graph Processing
zh_cn: 用于图计算的Gelly

source: Gelly is Flink’s graph processing API and library.
zh_cn: Gelly是Flink的图计算API库。

source: Gelly provides high-level program‐ ming abstractions in both Java and Scala to perform graph transformations, aggrega‐ tions, and iterative processing such as vertex-centric and gather-sum-apply.
zh_cn: Gelly为执行图转换、聚合及迭代（如vertex-centric和gather-sum-apply）提供了用于Java和Scala高层次的编程抽象。

source: GenericWriteAheadSink eases the implementation of sink operators with improved consistency properties.
zh_cn: GenericWriteAheadSink简化了那些具有更佳一致性属性的数据汇算子的实现。

source: GenericWriteAheadSink relies on a pluggable component called CheckpointCommit ter to store and look up information about committed checkpoints in an external persistent storage.
zh_cn: 而实际上，GenericWriteAheadSink依赖一个名为CheckpointCommitter的可插拔组件来控制外部持久化系统存储和查找已提交的检查点信息。

source: GenericWriteAheadSink works by appending all received records to a write-ahead log that is segmented by checkpoints.
zh_cn: GenericWriteAheadSink的工作原理是将经各个检查点"分段"后的接收记录以追加形式写如WAL中。

source: Give your project a name and click Finish
zh_cn: 为项目命名，然后单击Finish

source: Given a Flink setup with four TaskManagers that provide two slots each, a streaming application can be executed with a maximum par‐ allelism of eight.
zh_cn: 假设一个Flink设置包含4个TaskManager，每个TaskManager有2个处理槽，那么一个流式应用最多运行以并行度8来运行。

source: Given a Kubernetes cluster and an application that is packaged into a container image, you can create a deployment of the application that tells Kubernetes how many instances of the application to start.
zh_cn: 给定一个Kubernetes集群以和一个打包到容器镜像中的应用，你可以通过创建应用Deployment的方式告诉Kubernetes启动多少个应用实例。

source: Given a running ZooKeeper cluster and properly configured YARN and Flink setups, you can start a Flink cluster in job mode or session mode as if HA were not enabled—
zh_cn: 如果已经基于一个运行的ZooKeeper集群经配置好YARN和Flink，你就可以和非HA模式一样，通过./bin/flink run -m yarn-cluster和./bin/yarn-session.sh分别在作业模式和会话模式下启动Flink集群。

source: Given a working and well-configured YARN and HDFS setup, a Flink job can be sub‐ mitted to be executed on YARN using Flink’s command-line client with the following command:
zh_cn: 在YARN和HDFS都搭建完成且能够正常工作的前提下，就可以使用Flink CLI客户端运行以下命令将作业提交到YARN上执行：

source: Given an application and a compatible savepoint, you can start the application from the savepoint.
zh_cn: 给定一个应用和一个兼容的保存点，我们可以从该保存点启动应用。

source: Given the case of a source function operator that runs with a parallelism of two and that reads data from a Kafka topic with six parti‐ tions, each parallel instance of the source function will read records from three Kafka topic partitions.
zh_cn: 假设我们数据源函数算子的并行度为2，且需要从Kafka某主题的6个分区中读取数据，那么每个数据源函数的并行实例需要从3个分区读取记录。

source: Given the unpredictable reality of distributed systems and arbitrary delays that might be caused by external components, there are no categorically cor‐
zh_cn: 鉴于分布式系统现实的不确定性以及外部组件可能引发任意延迟，这些问题没有绝对正确的答案。

source: Given the unpredictable reality of distributed systems and arbitrary delays that might be caused by external components, there is no categorically correct answer to these questions.
zh_cn: 鉴于分布式系统现实的不确定性以及外部组件可能引发任意延迟，这些问题没有绝对正确的答案。

source: Given two TaskManag‐ ers with two processing slots each, this requirement is fulfilled.
zh_cn: 给定两个TaskManager，每个TaskManager内都有两个处理槽，即可满足该需求。

source: Given two TaskManagers with two processing slots each, this requirement is fulfilled.
zh_cn: 如果每个TaskManager内有两个处理槽，则给定两个TaskManager即可满足该需求。

source: Global
zh_cn: 全局

source: Global state refers to the keyed state that is not scoped to any window, while per-window state refers to the window instance that is currently being evaluated.
zh_cn: 其中单个窗口的状态指的是当前正在计算的窗口实例的状态，而全局状态指的是不属于任何一个窗口的键值分区状态。

source: Go to the Apache Flink webpage flink.apache.org and download the Hadoop-free binary distribution of Apache Flink 1.7.1 for Scala 2.12.
zh_cn: 从Apache Flink官网flink.apache.org下载支持Scala 2.12的Apache Flink 1.7.1无Hadoop二进制发行版。

source: Go to the Apache Flink webpage and download the Hadoop-free binary distribu‐ tion of Apache Flink 1.7.1 for Scala 2.12.
zh_cn: 从Apache Flink官网flink.apache.org下载支持Scala 2.12的Apache Flink 1.7.1 Hadoop-free二进制发行版。

source: HA Kubernetes Setup
zh_cn: Kubernetes的HA设置

source: HA Standalone Setup
zh_cn: 独立集群的HA设置

source: HA YARN Setup
zh_cn: YARN上的HA设置

source: HADOOP_CONF_DIR (preferred) or HADOOP_CONF_PATH environment variable.
zh_cn: 该工作可以通过导出HADOOP_CONF_DIR（建议选项）或HADOOP_CONF_PATH环境变量的方式来完成。

source: HDFS paths are prefixed with the hdfs:// scheme.
zh_cn: HDFS路径会以hdfs://协议开头。

source: Handling Late Data
zh_cn: 处理迟到数据

source: Handling Late Data | 149
zh_cn: 处理迟到数据 | 149

source: Handling Late Data | 151
zh_cn: 处理迟到数据 | 151

source: Handling delayed events is only one of the challenges that you can overcome with event time.
zh_cn: 使用事件时间要克服的挑战之一是如何处理延迟事件，

source: Have a look at the Kafka documentation for a comprehensive list of parameters.
zh_cn: 完整属性列表请查看Kafka相关文档。

source: Having no guaran‐ tees whatsoever sounds like a terrible idea, but it might be fine, if you can live with approximate results and all you care about is providing the lowest latency possible.
zh_cn: 无论如何，没有保障听上去都不是个好主意。但如果你能接受近似结果并且只关心提供尽可能低的延迟，这种保障可能没多大问题。

source: Having no guarantees whatsoever sounds like a terrible idea, but it might be fine if you can live with approximate results and all you care about is providing the lowest latency possible.
zh_cn: 无论如何，没有保障听上去都像是个馊主意。但如果你能接受近似结果并且一门心思地关注怎样降低延迟，这种保障似乎也可以接受。

source: He holds a PhD in computer science from TU Berlin.
zh_cn: 费比安在柏林工业大学取得了计算机科学博士学位。

source: Hence, FsStateBackend provides in-memory speed for local
zh_cn: 因此，FsStateBackend既让本地访问享有内存的速度，

source: Hence, Hadoop HDFS, S3, and NFS are commonly used filesys‐ tems.
zh_cn: 因此诸如Hadoop HDFS、S3以及NFS等都是常用的文件系统。

source: Hence, a GenericWriteAheadSink does not provide bullet‐
zh_cn: 因此，GenericWriteAheadSink并不能百分之百提供精确一次保障，而只能做到至少一次。

source: Hence, a Java JDK is required to implement Flink DataStream applications—Java JDK 8 (or higher).
zh_cn: 因此在写DataStream应用前需要安装Java JDK 8或更高版本（只有Java JRE是不够的）。

source: Hence, a late arriving ele‐ ment will not create a new window.
zh_cn: 因此，迟到的元素将不会创建新的窗口。

source: Hence, a single misbehaving task can kill a whole TaskManager process and all tasks that run on it.
zh_cn: 因此只要有一个任务运行异常，就会终止整个TaskManager进程，导致它上面运行的所有任务都停止。

source: Hence, a single misbehaving task can kill a whole TaskManager process and all tasks which run on the TaskManager.
zh_cn: 因此只要有一个任务运行异常，就会终止整个TaskManager进程，它上面运行的所有任务都会随之停止。

source: Hence, a slot-sharing group requires as many processing slots as the maximum parallelism of its operators.
zh_cn: 因此，一个处理槽共享组所需的处理槽数等于它内部算子的最大并行度。

source: Hence, a trigger must clear all of its state in the Trigger.clear() method to prevent
zh_cn: 所以说，为了避免状态泄露，触发器需要在Trigger.clear()方法中清除自身所有状态。

source: Hence, a typical application consists of multiple states that are distributed across multiple operator tasks that can run on different TaskManager processes.
zh_cn: 因此一个典型的应用会包含多个状态，它们分布在不同TaskManager进程内的算子任务上。

source: Hence, all data that is required to recover from a Job‐ Manager failure is stored in the remote storage and ZooKeeper holds pointers to the storage locations.
zh_cn: 因此所有用于JobManager故障恢复的数据都在远程存储上面，而ZooKeeper持有指向这些存储位置的指针。

source: Hence, all data that is required to recover from a JobManager failure is stored in the remote storage and ZooKeeper holds pointers to the storage locations.
zh_cn: 因此所有用于JobManager故障恢复的数据都在远程存储上面，而ZooKeeper持有这些存储位置的路径。

source: Hence, an application that con‐ sumes the output of the recovering application might witness a jump back in time, e.g., read a smaller count than before.
zh_cn: 因此消费故障恢复过程中所产生的结果可能会使应用"回到过去"，例如，读到一个比之前小的计数值。

source: Hence, changing the data type of a state is only supported
zh_cn: 所以说，修改状态的数据类型仅限于某些特定情况。

source: Hence, credit-based flow control is an important building block for Flink to achieve high throughput and low latency.
zh_cn: 不难看出，基于信用值的流量控制是Flink实现高吞吐低延迟的重要一环。

source: Hence, data transfer between tasks that run on the same TaskManager does not cause network communication.
zh_cn: 这意味着同一个TaskManager内不同任务之间的数据传输不会引起网络通信。

source: Hence, it can be useful to run stand-by JobManagers and TaskManagers that can take over the work of failed processes.
zh_cn: 因此运行一些后备JobManager及TaskManager来接管故障进程的工作会很有用。

source: Hence, it can be useful to run standby JobManagers and TaskManagers that can take over the work of failed processes.
zh_cn: 因此有必要运行一些后备JobManager及TaskManager来接管故障进程的工作。

source: Hence, it is important for data processors like Flink to provide a well-equipped library of connectors to read data from and write data to external systems as well as an API to implement custom connectors.
zh_cn: 因此对于Flink这样的数据处理引擎而言，很关键的一方面是能提供一套齐全的用于外部系统读写的连接器库，以及一组用于实现自定义连接器的API。

source: Hence, it is important that their execution does not stop even if an involved process fails.
zh_cn: 因此对于它很重要的一点是即便内部进程发生故障时也不能终止运行。

source: Hence, it is not difficult to update an application by removing stateful operators or state from an existing operator.
zh_cn: 因此，通过删除状态化算子或其中的状态来更新应用其实并不困难。

source: Hence, it is not uncommon for a checkpoint to take more time than the config‐ ured checkpointing interval.
zh_cn: 因此，检查点实际生成间隔长于配置间隔这种现象并不少见。

source: Hence, it should be ignored.
zh_cn: 因此需要将其忽略。

source: Hence, it will not be able to evict the state for the key because it might receive another record for the key.
zh_cn: 因此它根本无法准确移除某一键值的状态（因为不确定将来是否还有该键值的记录到来）。

source: Hence, its processing slows down and it might not be able to make enough pro‐ gress to keep up with the incoming data.
zh_cn: 因此，数据处理可能会变慢，导致跟不上数据接入的速率。

source: Hence, its storage must be considered volatile.
zh_cn: 因此它们的存储只能看做是易失的。

source: Hence, keyed state is very similar to a distributed key-value map.
zh_cn: 因此，键值分区状态看上去就像一个分布式键值映射（distributed key-value map）。

source: Hence, no events are lost and the state is completely built up from scratch.
zh_cn: 所以不会有任何事件丢失，状态也可以完全从最初开始构建。

source: Hence, no network communication is involved for a TaskManager-local connection.
zh_cn: 因此对于TaskManager本地连接而言无须网络通信。

source: Hence, only the JobManager can determine whether a check‐ point is successful or not.
zh_cn: 因此，只有JobManager才能对此作出判断。

source: Hence, simply relying on watermarks might not always be a good idea.
zh_cn: 因此简单地依赖水位线并不总是可以高枕无忧。

source: Hence, split can also be used to filter or replicate events.
zh_cn: 因此，split也可以用来过滤或复制事件。

source: Hence, the JobManager needs to acquire at least as many slots as the application’s maximum operator parallelism.6 Tasks are executed as threads within the worker (TaskManager) process and take as much CPU resources as they need.
zh_cn: 因此，JobManager至少需要获取和应用算子最大并行度等量的处理槽。6 任务会在工作进程（TaskManager）中以线程方式执行，它们可以按需获取足够的CPU资源。

source: Hence, the callback method has full access to the key’s state and can also clear it.
zh_cn: 因此在回调方法内你可以获得当前键值状态的完整访问权限并将其清除。

source: Hence, the choice and configuration of the application’s state backend has a large impact on the performance of the checkpoints.
zh_cn: 因此，应用状态后端的选择和配置对检查点相关操作的性能有很大影响。

source: Hence, the elements of both input streams can be jointly processed.
zh_cn: 这样一来，我们就可以联合处理两个输入流的元素。

source: Hence, the identifier of an operator changes when one of its predecessors changes, for example, when an operator is added or removed.
zh_cn: 这意味着任何一个前置算子发生改变（例如添加或删除某个算子）都会导致该标识发生变化。

source: Hence, the image cannot be used to set up a HA Flink cluster on Kubernetes.
zh_cn: 所以说该镜像无法直接用在Kubernetes上设置Flink HA集群。

source: Hence, the sink should be able to write to the sink system, but the written data must not be made visible to the outside before it is committed.
zh_cn: 如果是后者，数据汇需要能向外部系统写入数据，但在正式提交之前，这些数据不能对外可见。

source: Hence, the total state of an application must fit into
zh_cn: 因此JobManager的内存需要装得下应用的全部状态。

source: Hence, there are basically no serialization and communication costs for pass‐ ing records between functions.
zh_cn: 因此函数之间的记录传输基本上不存在序列化及通信开销。

source: Hence, there are basically no serialization and communication costs for passing records between functions.
zh_cn: 因此函数之间的记录传输基本上不存在序列化及通信开销。

source: Hence, they are as powerful as process functions.
zh_cn: 因此它其实和处理函数一样强大。

source: Hence, they are sufficient to restart an application after it failed but provide less flexibility than savepoints.
zh_cn: 因此它们虽然足以让应用在失败后重启，但无法提供保存点那样的灵活性。

source: Hence, they can to some extent mitigate the effect of replayed results as caused by Flink’s checkpointing mechanism.
zh_cn: 所以说，它们可以在一定程度上减轻Flink检查点机制所带来的重复结果的影响。

source: Hence, they clean up when a job stops running, either due to a failure or explicit cancellation.
zh_cn: 因此它们会在作业停止运行时（无论由于故障还是显式取消）被清理。

source: Hence, you can fix bugs in your application logic and reprocess as many events as your streaming source can provide in order to repair your results.
zh_cn: 这意味着你可以修复应用的一些逻辑Bug，然后在数据流来源的支持范围内下尽可能多地重新处理输入事件，以此来修复结果。

source: Hence, you cannot access the master con‐ tainer to submit an application or access the Web UI.
zh_cn: 因此你无法连接主进程容器来提交应用或访问Web UI。

source: Hence, you do not need to add a dependency to your build file to use it.
zh_cn: 因此在使用它时无需向构建文件中添加额外的依赖。

source: Hence, you do not need to add any other dependency to use this feature.
zh_cn: 因此你在用它的时候无需添加任何其他依赖。

source: Hence, you do not need to run standby processes in a YARN setup to achieve HA.
zh_cn: 因此你无须在YARN中设置后备进程就能实现HA。

source: Hence, you might need to explicitly provide TypeInformation objects to Flink for some of the data types used in your application.
zh_cn: 因此对于应用中的部分数据类型，可能需要你向Flink显式提供TypeInformation对象。

source: Hence, you should be aware that you might debug a multithreaded program.
zh_cn: 所以你应该做好调试多线程程序的准备。

source: Here are a few resources you can use to ask questions, attend Flink-related events, and learn what people use Flink for:
zh_cn: 下面列出的一些资源可供你提问问题，参与Flink相关的活动，并了解Flink的使用情况：

source: Here is an example that processes a stream of Long values and increments each element:
zh_cn: 下面的示例展示了如何处理一条Long值组成的数据流，对每个元素加一：

source: Here is the structure of a savepoint:
zh_cn: 下方是一个保存点的目录结构：

source: Here we describe some of the most commonly used metrics and refer you to Flink’s documentation for a full list of available metrics.
zh_cn: 接下来我们将向你介绍一些最长用到的指标。有关可用指标的完整列表请参阅Flink文档。

source: Here we explain how to do this with a
zh_cn: 此处我们只介绍使用用户自定义函数的方法。

source: Here, we briefly review some common data exchange strate‐ gies, as shown in Figure 2-3.
zh_cn: 下面我们结合图2-3来简单回顾一下常见的数据交换策略。

source: Here, we use a Scala case class as the data type that we defined before.
zh_cn: 在这里我们使用事先定义好的Scala样例类作为数据类型。

source: Highly Available Setup
zh_cn: 高可用性设置

source: Highly Available Setups
zh_cn: 高可用性设置

source: Highly Available Setups | 233
zh_cn: 高可用设置 | 233

source: Highly-Available Kubernetes Setup
zh_cn: 基于Kubernetes 的高可用设置

source: Highly-Available Setup
zh_cn: 高可用性设置

source: Highly-Available Setups
zh_cn: 高可用性设置

source: Highly-Available Stand-Alone Setup
zh_cn: 基于独立集群的高可用性设置

source: Highly-Available YARN Setup
zh_cn: 基于YARN的高可用性设置

source: How can you ensure that such failures are handled transparently so that your streaming job can continue to run?
zh_cn: 如何确保能够透明地处理这些故障，让流式作业得以继续运行？
